<?php
// This is a SPIP language file  --  Ceci est un fichier langue de SPIP
// extrait automatiquement de http://trad.spip.net/tradlang_module/paquet-nuage?lang_cible=ru
// ** ne pas modifier le fichier **

if (!defined('_ECRIRE_INC_VERSION')) return;

$GLOBALS[$GLOBALS['idx_lang']] = array(

	// N
	'nuage_description' => 'Этот плагин отображает ключевые слова в облаке, изменяя размер шрифта для ключевого слова в зависимости от количества связанных с ним элементов. Другими словами, SPIP может создавать «метки»!

Доступно несколько моделей:
-* article_nuage: отображает ключевые слова в статье, размер шрифта варьируется в зависимости от частоты слов в статьях на веб-сайте;
-* rubrique_nuage: отображает ключевые слова статей в рубрике, размер варьируется в зависимости от частоты слов в статьях этой рубрики;
-* nuage_popularite: отображает ключевые слова на веб-сайте (или в группе), размер варьируется в зависимости от относительной популярности (сумма популярности статей, к которым относится это слово).',
	'nuage_slogan' => 'Отображение ключевых слов разным размером шрифта'
);

?>
