<?php
// This is a SPIP language file  --  Ceci est un fichier langue de SPIP
// extrait automatiquement de http://trad.spip.net/tradlang_module/spipbb?lang_cible=ar
// ** ne pas modifier le fichier **

if (!defined('_ECRIRE_INC_VERSION')) return;

$GLOBALS[$GLOBALS['idx_lang']] = array(

	// A
	'a_propos_auteur_dpt' => 'كل المعلومات عن:',
	'admin_action_01_configuration' => 'إعداد',
	'admin_action_02_etat' => 'حالة المنتديات',
	'admin_action_ZZ_debug' => 'تصحيح الأخطاء',
	'admin_action_effacer' => 'مشاركات مرفوضة',
	'admin_action_fromphorum' => 'جلب من Phorum',
	'admin_action_fromphpbb' => 'جلب من PhpBB',
	'admin_action_gere_ban' => 'إدارة الاقصاءات',
	'admin_action_gestion' => 'إدارة',
	'admin_action_inscrits' => 'أعضاء',
	'admin_action_swconfig' => 'إعداد',
	'admin_action_swforum' => 'مشاركات معلمة',
	'admin_action_swlog' => 'سجل الخنزرة',
	'admin_action_swwords' => 'إدارة الكلمات',
	'admin_afficher_bouton_alerte_abus' => 'عرض أزرار التنبيه اساءة الاستعمال',
	'admin_afficher_bouton_rss' => 'عرض أزرار RSS',
	'admin_age_forum' => 'عمر المنتدى سنة/شهر',
	'admin_avatar_affiche' => 'القبول بالبدائل وعرضها (نعم افتراضياً لدى التثبيت)',
	'admin_avatar_taille_contact' => 'حجم البدائل (بالنقاط) في صفحة الاتصال',
	'admin_avatar_taille_profil' => 'حجم البدائل (بالنقاط) في صفحة المعلومات',
	'admin_avatar_taille_sujet' => 'حجم البدائل (بالنقاط) في صفحة المواضيع',
	'admin_average_posts' => 'معدل المشاراكات في اليوم',
	'admin_average_users' => 'معدل التسجيلات في اليوم',
	'admin_ban_email' => 'إدارة عناوين البريد الالكتروني المقصاة',
	'admin_ban_email_info' => 'لإدخال أكثر من عنوان بريد واحد، يجب الفصل بينها بفواصل. لتحديد الجوكر لاسم المستخدم، إدخال *. مثلاً: *@hotmail.com',
	'admin_ban_email_none' => 'لا يوجد عناوين مقصاة',
	'admin_ban_ip' => 'إداراة عناوين IP المقصاة',
	'admin_ban_ip_info' => 'لإدخال عدة عناوين IP او اسماء أجهزة خدمة مختلفة، يتم فصلها بفواصل. لتحديد نطاق عناوين IP، يجب الفصل بين البداية والنهاية بوصلة افقية (-)، لاستخدام الجوكر يتم إدخال نجمة (*).',
	'admin_ban_ip_none' => 'لا توجد عناوين مقصاة',
	'admin_ban_user' => 'إدارة المعرّفات المقصاة',
	'admin_ban_user_info' => 'يمكنك إقصاء عدة مستخدمين دفعة واحدة باستخدام تركيبة مفاتيح التحكم والعالي مع الفأرة او لوحة المفاتيح.',
	'admin_ban_user_none' => 'لا يوحد مستخدمون',
	'admin_cat_01_general' => 'مدير',
	'admin_cat_outils' => 'أدوات',
	'admin_cat_spam' => 'مضاد للخنزرة',
	'admin_config_prerequis' => 'المطلوب مسبقاً',
	'aecrit' => 'كتب',
	'annonce' => 'اعلان',
	'anonyme' => 'مجهول',
	'avatar' => 'الشخصية الوهمية',

	// C
	'citer' => 'ذكر',
	'creer_forum' => 'إنشاء منتدى جديد',

	// D
	'dans_forum' => 'في المنتدى',
	'dernier' => ' الاخير<br />',

	// E
	'ecrirea' => 'كتابة رسالة الى',
	'effacer' => 'حذف',
	'email' => 'البريد الالكتروني',
	'etplus' => '... وأكثر ...',

	// F
	'fil_deplace' => 'نقل هذا الخيط',
	'forum_ferme' => 'هذا المنتدى غير نشط·',
	'forum_ferme_texte' => 'هذا المنتدى غير نشط ولا يمكنك المشاركة فيه.',
	'forum_ouvrir' => 'فتح هذا المنتدى',

	// H
	'haut_page' => 'أعلى الصفحة',

	// I
	'icone_ferme' => 'اقفال',
	'info' => 'معلومات',
	'info_confirmer_passe' => 'تثبيت كلمة السر الجديدة:',
	'info_plus_cinq_car' => 'اكثر من خمسة احرف',

	// L
	'le' => 'في',
	'login' => 'دخول',

	// M
	'maintenance' => 'لا تنسى حذف<br />»مقفل للصيانة«،<br />
				من المنتديات المعنية.',
	'messages' => 'المشاركات',
	'messages_derniers' => 'المشاركات الاخيرة',
	'messages_voir_dernier' => 'عرض آخر مشاركة',
	'moderateurs' => 'المراقب (المراقبون)',

	// N
	'no_message' => 'لا يوجد اي موضوع او مشاركة يناسب ما تبحث عنه',

	// P
	'poste_valide' => 'مشاركات تنتظر المصادقة ...',
	'profil' => 'وصف',

	// R
	'recherche_elargie' => 'بحث موسّع',
	'reglement' => '<p>يجهد مدراء هذا المنتدى ومراقبوه لحذف او تحرير المشاركات ذات الطابع النابي بأسرع ما يمكن. الا انه من المستحيل ان يتمكنوا من التدقيق في كل المشاركات.
لذا من الطبيعي التذكير بأن المشاركات في هذا المنتدى تعبر عنة آراء أصحابها وليس عن آراء المدراء او المراقبين او مسؤولي الموقع (باستثناء المشاركات التي يرسلونها هم) وبالتالي ليسوا مسؤولين عنها.</p>

<p>توافق اذاً على عدم ارسال مشاركات مهينة او بذيئة او فظة او تشهيرية او مهددة او جنسية او اي رسالة اخرى تخرج عن القوانين المرعية تحت طائلة الطرد الفوري والدائم (اضافة الى اعلام موفر اتصالك بإنترنت بالامر). فيتم تسجيل عنوان IP العائد لكل مشاركة للمساعدة على تطبيق هذه الشروط. تعترف بحق مسؤول الموقع او مدير هذا المنتدى او مراقبيه في حذف اي موضوع نقاش او تحريره او اقفاله في اي لحظة. وبصفتك مستخدم، فإنك توافق على ان كل المعلومات التي تدخلها ادناه سيتم تخزينها في قاعدة بيانات. غير ان هذه المعلومات لن يفصح عنها لاي طرف ثالث او اي شركة دون موافقتك. ولن يكون مسؤول الموقع او المدير او المراقبون مسؤولين اذا تمت محاولة قرصنة ادت الى الوصول الى تلك البيانات.</p>

<p>يستخدم هذا المنتدى الكعكات لتخزين المعلومات في جهازك. ولن تحتوي هذه الكعكات على اي معلومات من تلك التي ستدخلها ادناه وتنحصر مهمتها في جعل استخدام المنتدى اكثر راحة وسهولة. 
اما عنوان البريد الالكتروني، فلن يستخدم الا للتأكد من تسجيلك وكلمة سرك (ولتزويدك بكلمة سر جديدة في حال اضعت كلمتك).
</p>
<p>بتسجيلك هنا تتعهد بالموافقة على الشروط اعلاه.</p>', # MODIF
	'repondre' => 'الرد',
	'retour_forum' => 'رجوع الى صفحة المنتدى الاساسية',

	// S
	'secteur_forum' => 'أقسام المنتديات',
	'selection_efface' => 'حذف التحديد .. ',
	'sinscrire' => 'تسجيل',
	'statut' => 'الوضع',
	'sujet' => 'الموضوع',
	'sujet_auteur' => 'المرسِل',
	'sujet_clos_texte' => 'هذا الموضوع مغلق ولا يمكنك وضع مشاركة فيه.',
	'sujet_clos_titre' => 'الموضوع مغلق',
	'sujet_nombre' => 'عدد المواضيع',
	'sujet_nouveau' => 'موضوع جديد',
	'sujet_rejete' => 'موضوع مرفوض',
	'sujet_valide' => 'موضوع بانتظار الموافقة',
	'sujets' => 'المواضيع',
	'sujets_aucun' => 'لا توجد مواضيع في هذا المنتدى حالياً',

	// T
	'tous_forums' => 'كل المنتديات',

	// V
	'voir' => 'عرض'
);

?>
