<plugin>
   <nom>
		<multi>
		[fr]Boutons dans le Texte
		[en]Buttons in the text
		[ar]&#1578;&#1603;&#1576;&#1610;&#1585; &#1608;&#1578;&#1589;&#1594;&#1610;&#1585;
		</multi>
	</nom>
	<slogan>
		<multi>
		[fr]Des boutons pour g&#233;rer la taille des caract&#232;res
		[en]Buttons to manage the font size
		</multi>
	</slogan>
	<auteur>[bertrand Gugger->http://toggg.com/]</auteur>
	<licence>&#169; 2006 LGPL</licence>
	<version>0.3.3</version>
	<etat>stable</etat>
	<description>
		<multi>
		[fr]Rajoute des boutons pour l'affichage des textes comme augmenter/diminuer police. Les boutons sont rajout&#233;s avant chaque div de classe texte du contenu si ils ne sont pas d&#233;j&#224; pr&#233;sents dans la page (images de classe textsizeup, textsizedown ou textonly)

La configuration optionnelle peut se faire en installant le plugin cfg. Certains &#233;l&#233;ments peuvent &#234;tre forc&#233;s par javascript.
		[en]Adds buttons to display text such as enlarge/reduce font point size. Buttons are added before each texte class div of the content if they are not already on the page (images under textsizeup, textsizedown or textonly classes)
		
Optional configuration could be achieved by installing the cfg plugin. Some elements can be forced through javascript
		[ar]&#1610;&#1590;&#1610;&#1601; &#1575;&#1586;&#1575;&#1585; &#1578;&#1603;&#1576;&#1610;&#1585; &#1608;&#1578;&#1589;&#1594;&#1610;&#1585; &#1575;&#1604;&#1582;&#1591; &#1601;&#1610; &#1606;&#1589; &#1575;&#1604;&#1605;&#1602;&#1575;&#1604;. &#1575;&#1604;&#1575;&#1586;&#1585;&#1575;&#1585; &#1578;&#1592;&#1607;&#1585; &#1602;&#1576;&#1604; &#1603;&#1604; &#1593;&#1604;&#1575;&#1605;&#1577; div &#1605;&#1606; &#1589;&#1606;&#1601; texte &#1601;&#1610; &#1575;&#1604;&#1606;&#1589; &#1575;&#1584;&#1575; &#1604;&#1605; &#1578;&#1603;&#1606; &#1605;&#1608;&#1580;&#1608;&#1583;&#1577; &#1587;&#1575;&#1576;&#1602;&#1575;&#1611; (&#1589;&#1608;&#1585; &#1605;&#1606; &#1589;&#1606;&#1601; textsizeup &#1608;textsizedown &#1608;textonly &#1604;&#1604;&#1606;&#1589; &#1601;&#1602;&#1591;)

&#1610;&#1605;&#1603;&#1606; &#1578;&#1606;&#1601;&#1610;&#1584; &#1575;&#1604;&#1575;&#1593;&#1583;&#1575;&#1583;&#1575;&#1604;&#1575;&#1582;&#1578;&#1610;&#1575;&#1585;&#1610; &#1576;&#1578;&#1579;&#1576;&#1610;&#1578; &#1575;&#1604;&#1605;&#1604;&#1581;&#1602; cfg &#1608;&#1576;&#1578;&#1581;&#1605;&#1610;&#1604; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577;. &#1610;&#1605;&#1603;&#1606; &#1601;&#1585;&#1590; &#1576;&#1593;&#1590; &#1575;&#1604;&#1593;&#1606;&#1575;&#1589;&#1585; &#1576;&#1608;&#1575;&#1587;&#1591;&#1577; &#1580;&#1575;&#1601;&#1575;&#1587;&#1603;&#1585;&#1610;&#1576;&#1578;
		</multi>
	</description>
	<lien>http://contrib.spip.net/Texte-agrandi-ou-pleine-page</lien>
	<prefix>boutonstexte</prefix>
	<icon>images/fontsizeup.png</icon>
	<options>boutonstexte_options.php</options>
	<pipeline>
		<nom>insert_head_css</nom>
		<inclure>boutonstexte_pipelines.php</inclure>
	</pipeline>
	<pipeline>
		<nom>insert_head</nom>
		<inclure>boutonstexte_pipelines.php</inclure>
	</pipeline>
	<chemin dir='' />
	<necessite id="SPIP" version="[1.9.0;2.1.99]" />
	<categorie>edition</categorie>
</plugin>
