<h1><img src="images/agenda.gif" alt="Logo : Agenda" />Cr&eacute;er un agenda</h1>
<div class="chapo">Dans un site utilisant EVA, on peut d&eacute;sormais faire un agenda.</div>
  
<div class="texte">

	<h3 class="spip">Agenda ou calendrier ?</h3>
	<p>Dans EVA il existe deux types d'agendas :</p>
	
	<p>1. Un agenda du type calendrier, que l'on nommera <strong>calendrier</strong> :</p>
	<div align="center"><img src="images/agenda_calendrier.jpg" alt="Agenda type calendrier" />
	<em>Celui-ci est recommand&eacute; pour les sites affichant un grand nombre d'&eacute;v&eacute;nements chaque mois.</em></div>
		
	<p>2. Un agenda plus simple, que l'on nommera <strong>agenda</strong> :</p>
	<div align="center"><img src="images/agenda_simple.jpg" alt="Agenda simplifi&eacute;" />
	<em>Celui-ci se veut &ecirc;tre plus simple, recommand&eacute; pour les sites affichant peu d'&eacute;v&eacute;nements. Ainsi le visiteur voit imm&eacute;diatement les &eacute;v&eacute;nements &agrave; venir : inutile d'aller aux mois suivants pour voir ce qu'il s'y passera.</em></div>

	<h3 class="spip">Cr&eacute;er un agenda</h3>
	
	<p>Un agenda est en fait une rubrique &agrave;&nbsp; laquelle on attache le mot-cl&eacute; "agenda" ou "calendrier" suivant le type d'agenda que l'on souhaite.</p>
	<div align="center"><img src="images/joindre_mot-cle_agenda.jpg" alt="Attacher le mot-cl&eacute; agenda" /></div>
	<p><strong>Remarque :</strong> <em>hormis le mot-cl&eacute; rattach&eacute; et la mani&egrave;re dont ils sont affich&eacute;s, les deux types d'agenda se comporteront exactement de la m&ecirc;me mani&egrave;re.</em></p>
	<p>Les &eacute;v&eacute;nements de l'agenda sont les articles de cette rubrique. Seulement, pour qu'un article apparaisse dans l'agenda, il faut indiquer une date de publication ant&eacute;rieure.<br />
	<strong>La date de publication en ligne</strong> est la date &agrave;&nbsp; partir de laquelle l'article (l'&eacute;v&eacute;nement) apparait sur le site, notamment sur la page d'accueil (dans les derniers articles).<br />
	<strong>La date de publication ant&eacute;rieure</strong> est la date &agrave;&nbsp; laquelle l'&eacute;v&eacute;nement (l'article) fait r&eacute;f&eacute;rence. Dans l'agenda, l'article apparaitra dans la case du jour (du mois et de l'ann&eacute;e) correspondant.</p>
	
	
	<h3 class="spip">Activer et utiliser les dates de publication ant&eacute;rieures</h3>
	<p>Pour pouvoir utiliser les dates de publication ant&eacute;rieures sur les articles, il faut les activer dans l'interface de SPIP. Allez dans : <a href="../ecrire/?exec=configuration">Administration du site &gt; Configuration &gt; Contenu du site &gt; Les articles</a><br />
	Puis cochez "<em>oui</em>" pour "<em>Date de publication ant&eacute;rieure</em>", enfin cliquez sur <strong>[Valider]</strong>.</p>
	<div align="center"><a href="../ecrire/?exec=configuration"><img src="images/activer_date_publication_anterieure.jpg" alt="Activer date de publication ant&eacute;rieure" /></a></div>
	<p>Pour mettre une date de publication ant&eacute;rieure &agrave;&nbsp; un article, allez sur la page d'&eacute;dition de l'article, en dessous de la date de publication en ligne, d&eacute;veloppez la fl&egrave;che, cochez "Afficher ...", puis renseignez votre date :</p>
	<div align="center"><img src="images/date_publication_anterieure.jpg" alt="date de publication ant&eacute;rieure" /></div>
	<p>Ici, l'article &agrave;&nbsp; &eacute;t&eacute; publi&eacute; le <em>29 juin 2005</em>, mais l'&eacute;v&eacute;nement auquel il faisait r&eacute;f&eacute;rence aura lieu le <em>1er juillet 2005</em>.<br />
	L'article est "apparu" le <em>29 juin 2005</em> sur la page d'accueil, mais dans l'agenda il apparaitra comme &eacute;tant un &eacute;v&eacute;nement dat&eacute; au <em>1er juillet 2005</em></p>
	
	
	
	<h3 class="spip">Cr&eacute;er et utiliser des th&egrave;mes dans l'agenda</h3>
	<p>Dans les (deux types) agendas qui correspondent donc &agrave;&nbsp; des rubriques, on peut avoir plusieurs sous-rubriques contenant elles m&ecirc;mes des articles. Ces sous-rubriques seront les "th&egrave;mes" de l'agenda.</p>
	<div align="center"><img src="images/agenda_themes-ecrire.jpg" alt="Cr&eacute;er des th&egrave;mes dans l'agenda" /></div>
	<p><em>Chaque &eacute;v&eacute;nement de l'agenda (chaque article en fait), devra donc &ecirc;tre class&eacute; dans le bon "th&egrave;me" (la bonne sous-rubrique).</em></p>
	<p>Ensuite c&ocirc;t&eacute; visiteur, si on va dans l'agenda (rubrique de d&eacute;part) on verra tous les articles (&eacute;v&eacute;nements) de cette rubrique, ainsi que ceux des th&egrave;mes (sous-rubriques). Plus on descendra dans l'arborescence (sous-rubriques), plus on "restreindra" les &eacute;v&eacute;nements affich&eacute;s : l'agenda affichera toujours les articles de la rubrique courante et ceux des sous-rubriques.</p>
	<p><strong>Exemple : </strong><br />
	<img src="images/agenda_themes.gif" alt="Logo : agenda" /><br />
	<em>Si l'on descend dans le th&egrave;me "Vie de l'&eacute;cole", on ne verra plus que les &eacute;v&eacute;nements du th&egrave;me "Vie de l'&eacute;cole" et du sous-th&egrave;me "R&eacute;unions" ; les &eacute;v&eacute;nements des autres th&egrave;mes ne seront plus visibles.</em></p>
	
	
	
	<h3 class="spip">Utiliser les logos</h3>
	<p>Si vous utilisez plusieurs th&egrave;mes, il est recommand&eacute; de personnaliser le logo de chaque th&egrave;me. Il sera plus facile pour les utilisateurs de lire cet agenda, et voir pour chaque &eacute;v&eacute;nement &agrave; quel th&egrave;me il fait r&eacute;f&eacute;rence.</p>
	<p>Le logo "de base" d'un agenda est celui ci :<img src="../images/agenda.gif" /></p>
	<p>Enfin si vous souhaitez faire appara&icirc;tre dans la barre des boutons celui de votre rubrique agenda, il suffit de lui ajouter le mot-cl&eacute; "bouton" en plus de "agenda", comme d&eacute;crit dans : <a href="?perso=boutons">Boutons du menu</a></p>
	
</div>

<div class="notes">Vous pouvez cr&eacute;er plusieurs agendas (plusieurs rubriques ayant pour mot-cl&eacute; "agenda" ou "calendrier").</div>


