<h1><img src="images/ecrire.gif" alt="Logo : &eacute;crire" />Cr&eacute;er un album photo</h1>
<br class="clear" />
<div class="chapo">Les squelettes EVA ont &eacute;t&eacute; pens&eacute;s afin 
  de permettre la cr&eacute;ation d'albums photos, le plus simplement possible.</div>
<div class="texte"> 
  <p>Un album photo est un article, dont le squelette (l'affichage sur le site 
    public), est sp&eacute;cifique et se pr&eacute;sente sous la forme d'une mosa&iuml;que 
    d'images.
  <div align="center"><img src="images/album_photo.jpg" alt="Aper&ccedil;u de l'album photo" /></div></p>
  <ol>
    <li>Cr&eacute;er votre article &quot;normalement&quot; (voir : <a href="?aide=article">Ecrire 
      ou modifier un article</a>). Le titre de l'article sera alors le titre de 
      l'album photo, et le texte (et chapeau, post-scriptum, ...) en sera une 
      pr&eacute;sentation d&eacute;taill&eacute;e.<br>
      <br>
      Une fois votre article cr&eacute;&eacute;, vous pouvez alors y attacher 
      des documents, en l'occurence des photos, dessins, ...<br>
      <br>
    </li>
    <li> Attachez vos images en tant que documents : 
      <p><img src="images/ajouter_document.jpg" alt="Joindre un document" style="float:left" />
      	<em>Cliquez d'abord sur le triangle noir pour d&eacute;velopper 
            (ci-contre). Cliquez sur <strong>[Naviguer...]</strong>, puis allez 
            s&eacute;lectionner l'image que vous souhaitez attacher &agrave; l'article. 
            Cliquez ensuite sur <strong>[T&eacute;l&eacute;charger]</strong>, 
            attendez que le fichier ait &eacute;t&eacute; charg&eacute; sur le 
            serveur, plus le fichier est gros plus le transfert sera long. <strong>La 
            largeur recommand&eacute;e pour un affichage optimal est d'environ 
            500 pixels. </strong> </em> </p>
            <p><em>Une fois le fichier joint, la page se rafraichit.</em></p>
    
    <li> Dans les param&egrave;tres de l'image que vous avez jointe, vous pouvez : 
    	<img src="images/joindre_photo.jpg" alt="Joindre un document" style="float:left" />
      
            <p>Il s'agit de l'aper&ccedil;u qui permettra d'afficher la photo 
              quand on clique dessus.</p>
              
          <p>Personnaliser le titre et descriptif du document, soit le commentaire 
            de la photo.</p>
          
          <p style="margin-top:80px">Vous pouvez &eacute;galement supprimer le document tant que l'article 
            est toujours &quot;en cours de r&eacute;daction&quot;. Ensuite seuls 
            les administrateurs pourront supprimer/modifier le document.</p>
            
          <p style="margin-top:40px">Remplacer la vignette par d&eacute;faut en mettant une version 
              plus petite de l'image (environ 100 pixels de largeur). Cliquez 
              sur <strong>[Naviguer...]</strong>, puis allez selectionner l'image 
              souhait&eacute;e et cliquez ensuite sur <strong>[T&eacute;l&eacute;charger]</strong>. </p>
      <p><strong> Attention &agrave; ne pas mettre une image trop volumineuse, 
              il est recommand&eacute; de choisir des vignettes de 100 pixels 
              de largeur environ.</strong></p>

      <br class="clear" />
      <p><strong> Pour d&eacute;finir l'ordre dans lequel les photos vont d&eacute;filer 
      et appara&icirc;tre</strong>, il vous suffira de num&eacute;roter le titre 
      des documents, en rajoutant : &lt;num&eacute;ro&gt;&lt;point&gt;&lt;espace&gt; 
      devant le titre de chaque document. Par exemple :<br />
      1. Premi&egrave;re photo<br />
      2. Seconde photo<br />
      30. Troisi&egrave;me photo<br />
      45. etc ...</p>
    <li> Une fois votre album photo "fini", n'oubliez pas d'attacher le mot-cl&eacute; 
      <strong>&quot;album&quot;</strong> &agrave; votre article, afin que sur 
      le site public votre article prenne la mise en page propre &agrave; un album 
      photo.<br>
      <br>
      remarque : pour voir apparaitre la zone &quot;mots-cl&eacute;s&quot;, il 
      faut &ecirc;tre en &quot;interface compl&egrave;te&quot;.<br>
      <div align="center"> <img src="images/joindre_mot-cle_album.jpg" alt="Attacher le mot-cl&eacute; album" />   </div>
      Cliquez sur le triangle noir pour d&eacute;velopper, sur le groupe &quot;Type 
      d'affichage&quot;, s&eacute;lectionnez le mot-cl&eacute; &quot;album&quot; 
      enfin cliquez sur <strong>[Choisir]</strong>. 
  </ol>
</div>
