<h1><img src="images/ecrire.gif" />Cr&eacute;er un diaporama</h1>
<br class="clear" />
<div class="chapo">Les squelettes EVA ont &eacute;t&eacute; pens&eacute;s afin 
  de permettre la cr&eacute;ation de diaporamas, le plus simplement possible.</div>
<div class="texte">
  <p>Un diaporama est constitu&eacute; de l'ensemble des articles d'une rubrique. 
    Le diaporama est donc la rubrique elle m&ecirc;me, ses articles &eacute;tant 
    les diff&eacute;rentes diapositives. Dans une rubrique diaporama, les articles 
    auront un affichage sp&eacute;cifique, notamment l'int&eacute;gration automatique 
    des boutons &quot;Suivant&quot;, &quot;Pr&eacute;c&eacute;dent&quot; permettant 
    de passer d'une diapo &agrave; l'autre ... </p>
  <div style="text-align:center"><img src="images/diaporama.jpg" alt="aper&ccedil;u diaporama" /></div>
  <p>Note : le texte des articles (+ chapeau, post-scriptum, ...), ou son contenu, 
    est ensuite tout &agrave; fait &quot;classique&quot; et peut donc contenir 
    du texte des images, documents joints, ...</p>
  <p>Pour ce faire <strong>il suffit d'attacher le mot-cl&eacute; &quot;diaporama&quot; 
    &agrave; la rubrique concern&eacute;e.</strong> Ainsi tous les articles de 
    cette rubrique prendront l'aspect d'un diaporama. Ensuite cr&eacute;ez autant 
    d'articles dans la rubrique que de pages pour votre diaporama.</p>
  <p><strong>Remarque :</strong> pour voir apparaitre la zone &quot;mots-cl&eacute;s&quot;, 
    il faut &ecirc;tre en &quot;interface compl&egrave;te&quot;.</p>
  <p>Cliquez sur le triangle noir pour d&eacute;velopper, puis sur le groupe &quot;Type 
    d'affichage&quot;, s&eacute;lectionnez &quot;diaporama&quot; et cliquez sur 
    le bouton <strong>[Choisir]</strong>.</p>
  <div align="center"><img src="images/joindre_mot-cle_diaporama.jpg" alt="Attacher le mot-cl&eacute; diaporama" /></div>
  <p>Pour d&eacute;finir l'ordre dans lequel les articles vont d&eacute;filer, 
    il vous suffira de num&eacute;roter vos articles, en rajoutant : &lt;num&eacute;ro&gt;&lt;point&gt;&lt;espace&gt; 
    devant le titre de chaque article. Par exemple :<br>
    1. Premi&egrave;re diapo<br>
    2. Seconde diapo<br>
    30. Troisi&egrave;me diapo<br>
    45. etc ...</p>
  <ul>
    <strong>Remarque :</strong> 
    <li>Seuls les administrateurs peuvent cr&eacute;er et modifier les rubriques 
      d'un site sous SPIP ; donc seul un administrateur pourra cr&eacute;er la 
      rubrique correspondante et y attacher le mot-cl&eacute; &quot;diaporama&quot;.</li>
    <li> Si l'on attache le mot-cl&eacute; &quot;diaporama&quot; &agrave; cette 
      rubrique aucun de ses articles ne pourra &ecirc;tre pr&eacute;sent&eacute; 
      comme un <a href="?aide=album">album photo</a> (m&ecirc;me s'il contient 
      le mot-cl&eacute; album).</li>
  </ul>
</div>


