<h1><img src="images/image.png" alt="logo PNG" />Placer une image dans un article</h1>
<br class="clear" />
<div class="chapo">Pour joindre une image &agrave; un article, il est imp&eacute;ratif 
  que l'article ait d&eacute;j&agrave; &eacute;t&eacute; cr&eacute;&eacute;.</div>
<div class="texte"><p>Attention, &agrave; ne pas placer des images trop lourdes ; dans ce cas choisissez 
  plut&ocirc;t de la joindre en tant que document, et dans l'article, placez la vignette 
  &agrave; l'endroit d&eacute;sir&eacute; (le lien vers le "grand" format sera fait automatiquement).</p>
<ol>
  <li>Dans l'interface d'administration, naviguez dans l'arborescence jusqu'&agrave; 
    l'article auquel vous voulez joindre une image.<br>
  </li>
  <li>Cliquez sur <img src="images/modifier_article.jpg" alt="Modifier cet aticle" /><br>
  </li>
  <li>Dans la page d'&eacute;dition de l'article, sur le c&ocirc;t&eacute; gauche : 
    <img src="images/ajouter_image.jpg" alt="Ajouter une image" style="float:left" />
    <p><em>Cliquez d'abord sur le triangle noir pour d&eacute;velopper (ci-contre). Cliquez sur <strong>[Parcourir]</strong>, puis allez selectionner l'image que vous souhaitez attacher &agrave; l'article. Cliquez ensuite sur <strong>[T&eacute;l&eacute;charger]</strong>, attendez que le fichier ait &eacute;t&eacute; charg&eacute; sur le serveur, plus le fichier est gros plus le transfert sera long. </em></p>
    <p><em>Une fois le fichier joint, la page se rafraichit.</em></p>
  </li>
  <li>Pour faire apparaitre l'image dans l'article il vous suffira d'y copier 
    les "petits" codes (dans le champs "texte" et/ou "descriptif") : </li>
  <ul>
    <li>&lt;img5|left&gt; : pour aligner l'image &agrave; gauche, par rapport &agrave; un paragraphe, 
      une ligne de texte, etc ...</li>
    <li>&lt;img5|center&gt;: pour centrer l'image</li>
    <li>&lt;img5|right&gt;: pour aligner l'image &agrave; droite, par rapport &agrave; un paragraphe, 
      une ligne de texte, etc ...<br>
    </li>
  </ul>
  <li> Dans les param&egrave;tres de l'image que vous avez ajout&eacute;e, vous pouvez : 
	    <img src="images/modifier_image.jpg" alt="Modifier l'image" style="float:left" />
	    <p><em>Changer le titre de l'image et le descriptif si vous le souhaitez.</em></p>
	    
	    <p style="margin-top:230px"><em>Vous pouvez &eacute;galement supprimer l'image tant que l'article est toujours "en cours de r&eacute;daction". Ensuite seuls les administrateurs pourront supprimer/modifier l'image.</em></p>
  </li>
</ol></div>

