<plugin>
	<nom><multi>[fr]Traduction d'articles autrement[en]Article translations differently[es]Traducci&#243;n de art&#237;culos repensada[de]Artikel &#220;bersetzung mal Anders</multi></nom>
	<slogan>Rendre la traduction des articles plus aisée</slogan>
	<auteur>[Rainer Müller->http://websimple.be]</auteur>
	<version>0.3.4</version>
	<etat>stable</etat>
	<description>
		<multi>
		[fr]
			Modification de l'interface priv&#233; de;de spip afin de permettre &#224; l'utilisateur une autre approche pour la traductions des articles; tout en maintenant le syst&#232;me de traduction original de spip. Pour pouvoir utiliser l'affichage compacte des listes d'article (option disponible via cfg), il faut installer le plugin [afficher_objets->http://files.spip.org/spip-zone/afficher_objets.zip]

			Les listes compactes fonctionnent maintenant &#233;galement sur un site avec du multilinguisme par section. Il faut pour cela installer le plugin [Traduction entre rubrique->http://files.spip.org/spip-zone/tradrub.zip] . 

			Et pour pour pouvoir profiter d'un syst&#232;me de traduction dans le sens du pr&#233;sent plugin, installez en plus le plugin [Traductions rubriques autrement->http://files.spip.org/spip-zone/traduction_rubriques_autrement.zip]. Les boutons de traduction seront affich&#233;s en haut de la rubrique avec la possibilit&#233; de cr&#233;er les traductions manquantes en cliquant sur l'onglet en gris. Le plugin essayera de chercher la rubrique correspondante dans le secteur de la langue, si la rubrique parente est bien traduite	
		[en]
			Modification of the backoffice to allow another visual approach for the translation of articles. If you want to use the compact mode for the articles list (available through cfg) you need to install the plugin [afficher_objets->http://files.spip.org/spip-zone/afficher_objets.zip].

			If your site structure is based on one section per language you may consider installing the plugins  [Translation between sections->http://files.spip.org/spip-zone/tradrub.zip] .and [Section translations differently->http://files.spip.org/spip-zone/traduction_rubriques_autrement.zip]

		[es]
			Modificaci&#243;n del espacio interno de spip para facilitar la traducci&#243;n de los art&#237;culos sin cambiar el sistema original de traducci&#243;n. Si quiere aprovechar de la opci&#243;n "lista compacta de art&#237;culos" (activada desde cfg), hace falta instalar el plugin [afficher_objets->http://www.codes-libres.org/zip-plugins/afficher_objets.zip]

			Si tu sitio est&#224; hecho con una estructura de un idioma por secci&#243;n, te sugiero instalar tambi&#233;n los dos siguientes plugins [Translation between sections->http://files.spip.org/spip-zone/tradrub.zip]  y [Section translations differently->http://files.spip.org/spip-zone/traduction_rubriques_autrement.zip]

		[de]
			&#196;nderung des SPIP Backoffices mit dem Ziel die &#220;bersetzung der Artikel visuell anders anzugehen. Wenn sie die "Kompakte Artikel Listen" benutzen wollen (kann via cfg aktiviert werden), m&#252;ssen Sie das plugin [afficher_objets->http://files.spip.org/spip-zone/afficher_objets.zip] installieren. 

			F&#252;r Sites mit Sprache per Rubrik Strukturen, empfehle, ich ebenfalls folgende zwei Plugins 
			[Translation between sections->http://files.spip.org/spip-zone/tradrub.zip]. 	
			und [Section translations differently->http://files.spip.org/spip-zone/traduction_rubriques_autrement.zip]
		</multi>	
	</description>
	<lien>http://www.spip-contrib.net/Traductions-d-articles-autrement</lien>
	<licence>GPL 3</licence>
	<prefix>taa</prefix>
	<icon>img_pack/Translation-icon_32.png</icon>
	<pipeline>
		<nom>header_prive</nom>
		<inclure>taa_pipelines.php</inclure>
	</pipeline>
	<pipeline>
		<nom>afficher_fiche_objet</nom>
		<inclure>taa_pipelines.php</inclure>
	</pipeline>	
	<pipeline>
		<nom>formulaire_charger</nom>
		<inclure>taa_pipelines.php</inclure>
	</pipeline>		
	<pipeline>
		<nom>pre_insertion</nom>
		<inclure>taa_pipelines.php</inclure>
	</pipeline>	
	<pipeline>
		<nom>affiche_gauche</nom>
		<inclure>taa_pipelines.php</inclure>
   </pipeline>	
	<fonctions>taa_fonctions.php</fonctions>
	<categorie>edition</categorie>
	<necessite id="SPIP" version="[2.0.0;2.1.99]" />
	<utilise id="afficher_objets" version="[1.1.8;]" />	
	<utilise id="cfg" version="[1.15.1;]" />	
	<utilise id="medias" version='[1.6.1;]'/>	
	<traduire gestionnaire="salvatore" module="taa" reference="fr" />
</plugin>

