<plugin>
    <nom>
		<multi>
			[fr]Boutons d&#8217;admin suppl&#233;mentaires
			[de]Zus&#228;tzliche Administrations-Buttons
		</multi>
    </nom>
    <prefix>boutons_admin_supp</prefix>
    <icon>icon/boutons_admin_supp.png</icon>
	
    <version>2.4.1</version>
    <etat>stable</etat>
	<categorie>maintenance</categorie>
	
	<slogan>Des boutons d&#8217;admin suppl&#233;mentaires sur le site public</slogan>
    <description>
	<multi>
	[fr]Ce plugin ajoute des boutons d&#8217;administration suppl&#233;mentaires sur le site public permettant, par exemple, d&#8217;&#233;diter directement le texte d&#8217;un article, d&#8217;une rubrique, d&#8217;acc&#233;der &#224; l&#8217;interface priv&#233;e, de cr&#233;er un nouvel article, etc. Les possibilit&#233;s offertes d&#233;pendent du statut&nbsp;: par exemple, seuls les administrateurs disposent d&#8217;un bouton pour cr&#233;er une rubrique.

	Un bouton &laquo;&nbsp;plus-moins&nbsp;&raquo; permet d'afficher-masquer la barre d&#8217;&#233;dition et un autre (en forme de trombone) de garder cette barre au premier plan (sauf Internet Explorer).

	Un fichier de configuration permet de choisir les boutons suppl&#233;mentaires qu&#8217;on d&#233;sire voir appara&#238;tre afin de masquer d&#233;finitivement ceux qui ne semblent pas utiles. La configuration est globale et concerne tous les utilisateurs.

	[de]Dieses Plugin f&#252;gt im &#246;ffentlichen Bereich zus&#228;tzliche Administrations-Buttons hinzu, die Beispielsweise erm&#246;glichen, den Text eines Artikels, einer Rubrik direkt zu editieren, in den privaten Redaktionsbereich zu gelangen, eine neuen Artikel zu erzeugen, etc. Die M&#246;glichkeiten h&#228;ngen vom Status ab: nur die Administratoren zum Beispiel k&#246;nnen eine Rubrik erzeugen.

	Ein Button (in Form eines plus oder minus) erm&#246;glicht, die Toolbar anzuzeigen oder zu verstecken, ein anderer (eine B&#252;roklammer) erlaubt, die Toolbar im Vordergrund zu lassen (dieser Button ist nicht aktiv f&#252;r Internet Explorer).

	Die verwendete Technik ist nicht besonders originell (&#220;berladung der Datei <code>formulaire_admin.html</code>): sie ist zum Beispiel [auf dieser Seite->http://contrib.spip.net/Administrer-un-site-web-depuis-l] erkl&#228;rt. Die einzige Originalit&#228;t ist hier die Pr&#228;sentation in Form eines Plugins, das keine &#196;nderung von Dateien oder Skeletten notwendig macht und die Updates erleichtert. Die Titel der Buttons werden der jeweiligen Sprache der Oberfl&#228;che angepasst.

	Zu bachten ist, dass die Rubriken, Artikel etc die durch die Buttons erzeugt worden sind, in der Rubrik platziert sind von der aus man im &#246;ffentlichen Bereich auf den Button geklickt hat.

	Eine Konfigurationsdatei erlaubt es, die zus&#228;tzlichen Buttons zu w&#228;hlen, die angezeigt oder definitif versteckt werden sollen. Die Konfiguration ist global und betrifft alle Nutzer.
	</multi>
    </description>
    <lien>http://contrib.spip.net/Boutons-d-administration-supplementaires</lien>
	<licence>GNU/GPL</licence>
    <auteur>[Vincent Ramos->http://contrib.spip.net/auteur7639.html]</auteur>
	
    <pipeline>
        <nom>insert_head</nom>
        <inclure>boutons_admin_supp_fonctions.php</inclure>
    </pipeline>
    <pipeline>
        <nom>insert_head_css</nom>
        <inclure>boutons_admin_supp_fonctions.php</inclure>
    </pipeline>
	<necessite id="SPIP" version="[1.9.0;2.1.99]" />
</plugin>