<plugin>
	<nom>Momo</nom>
	<slogan>
		Momo&nbsp;: les mots sur les mots&nbsp;!
	</slogan>
	<auteur>[Bertrand Marne->http://www.spip-contrib.net/Beurt]</auteur>
	<licence>GNU/GPL</licence>
	<version>0.2.1</version>
	<version_base>0.1</version_base>
	<etat>test</etat>
	<description>
Momo (diminutif de {mots sur mots}), vous permet de lier des mots-cl&eacute;s &agrave; d'autres mot-cl&eacute;s.

Dans la partie priv&eacute;e, le plugin Momo propose une inteface pour associer des mots-cl&eacute;s parents &agrave; un mot-cl&eacute; donn&eacute;. Attention, pour &eacute;viter les liens circulaires, il ne faut pas associer &agrave; un mot-cl&eacute; donn&eacute;, un parent qui est d&eacute;j&agrave; un de ses enfants.

Dans la partie publique, le plugin Momo propose:

-* un nouveau crit&egrave;re de la boucle MOTS: <code>{id_mot_parent=xxx}</code> o&ugrave; <code>xxx</code> est un id_mot qui permet de ne retourner que les mots-cl&eacute;s ayant un parent donn&eacute;.
-* Il y a trois squelettes de d&eacute;mo:
-** <code>/spip.php?page=demomo</code> qui affiche parents, enfants et hi&eacute;rarchie(s) d'un ou tous les mots (on peut notamment donner un id_mot en param&egrave;tre: <code>&id_mot=XXX</code> o&ugrave; <code>XXX</code> est l'id_mot).
-** <code>/spip.php?page=demomo_graph</code> qui utilise des librairies javascript externes (connexion &agrave; internet n&eacute;cessaire) dont l'exellente JSplump pour afficher {{graphiquement}} toutes les hi&eacute;rarchies d'un mot-cl&eacute; pass&eacute; en param&egrave;tre (<code>&id_mot=XXX</code> o&ugrave; <code>XXX</code> est l'id_mot).
-** <code>/spip.php?page=graphe_mots_site</code> utilise aussi ces librairies javascript externes et affiche {{graphiquement}} toute la hi&eacute;rarchie des mots-cl&eacute; (les mots-cl&eacute; sans parents, ni enfants, ne sont pas affich&eacute;s).
-* Il y a aussi des mod&egrave;les pour tester&nbsp;:
-** <code>enfants_mot</code> qui donne r&eacute;cursivement tous les enfants d'un mot
-** <code>parents_mot</code> qui liste les parents d'un mot
-** <code>hierarchies_mot</code> qui liste les fils d'Ariane possibles pour un mot donn&eacute; (voir le squelette du mod&egrave;le pour comprendre comment choisir l'un des fils d'Ariane: avec un ou plusieurs id_groupe)
-** <code>doublons_enfants_mot</code> qui retourne une liste des id_mot de tous les enfants d'un mot, r&eacute;cursivement. Cette liste est brute et peut &ecirc;tre exploit&eacute;e avec un <code>|explode{','}</code> dans les crit&egrave;res d'une boucle (ex.: <code><BOUCLE_Enfants du mot(MOTS){id_mot IN #MODELE{doublons_enfants_mot}{id_mot}|explode{','}}></code> voir le formulaire <code>attache_momo</code>)
-** <code>doublons_parents_directs_mot</code> qui retourne une liste des id_mot des parents directs d'un mot. Cette liste est brute et peut &ecirc;tre exploit&eacute;e avec un <code>|explode{','}</code> dans les crit&egrave;res d'une boucle (ex.: <code><BOUCLE_Mot_Parents_directs(MOTS){id_mot IN #MODELE{doublons_parents_directs_mot}{id_mot}|explode{','}}></code> voir le formulaire <code>attache_momo</code>)
-** <code>doublons_hierarchies_mot</code> qui retourne des listes des id_mot des parents selon les fils d'Ariane possibles pour un mot-cl&eacute;. On ne l'utilise pas directement dans un IN. Voir les d&eacute;tails dans les commentaires du squelette du mod&egrave;le.
	</description>
	<prefix>momo</prefix>
	<icon>images/tag-32.png</icon>
	<install>base/momo_installation.php</install>
	<pipeline>
		<nom>declarer_tables_interfaces</nom>
		<inclure>base/momo_tables.php</inclure>
	</pipeline>
	<pipeline>
		<nom>declarer_tables_auxiliaires</nom>
		<inclure>base/momo_tables.php</inclure>
	</pipeline>
	<pipeline>
		<nom>affiche_milieu</nom>
		<inclure>momo_pipelines.php</inclure>
	</pipeline>
	<pipeline>
		<nom>editer_contenu_objet</nom>
		<inclure>momo_pipelines.php</inclure>
	</pipeline>
	<pipeline>
		<nom>libelle_association_mots</nom>
		<inclure>momo_pipelines.php</inclure>
	</pipeline>
	<fonctions>momo_fonctions.php</fonctions>
	<necessite id="SPIP" version="[2.1.0;2.1.99]" />
	<categorie>navigation</categorie>
</plugin>
